In [34]:
import pandas as pd
import numpy as np

In [35]:
tt = pd.read_excel(r'C:\Users\LENOVO\Desktop\Datasets\Titanic.xlsx',encoding = "UTF-8")
tt.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [102]:
tt.count()

Survived                   887
Age                        887
Siblings/Spouses Aboard    887
Parents/Children Aboard    887
male                       887
dtype: int64

In [36]:
tt.drop(['Pclass','Name'],axis=1,inplace=True)

In [37]:
gender = pd.get_dummies(tt['Sex'],drop_first=True)
gender.head()

   male
0     1
1     0
2     0
3     0
4     1

In [38]:
tt = pd.concat([tt,gender],axis=1)
tt.head()

,Survived,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,male
0,0,male,22.0,1,0,7.2500,1
1,1,female,38.0,1,0,71.2833,0
2,1,female,26.0,0,0,7.9250,0
3,1,female,35.0,1,0,53.1000,0
4,0,male,35.0,0,0,8.0500,1

In [39]:
tt.drop(['Sex','Fare'],axis=1,inplace=True)

In [40]:
tt.head()

   Survived   Age  Siblings/Spouses Aboard  Parents/Children Aboard  male
0         0  22.0                        1                        0     1
1         1  38.0                        1                        0     0
2         1  26.0                        0                        0     0
3         1  35.0                        1                        0     0
4         0  35.0                        0                        0     1

In [105]:
#X = tt[:,2,3,4]
#y = tt['Survived']
X = tt.loc([0:888])
#from sklearn.model_selection import train_test_split
#X_train, X_test, y_train, y_test = train_test_split(X, y)

SyntaxError: invalid syntax (<ipython-input-105-8ee2312d199b>, line 3)